## Staging: glue
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                 |
|--------|--------------------------------------|
| update | `aws_glue_connection.forms_database` |
|        | `aws_iam_policy.glue_etl`            |
|        | `aws_s3_object.historical_csv`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.glue_database_connection will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "glue_database_connection" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetConnection",
              + "glue:GetConnections",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:glue:ca-central-1:687401027353:connection/forms-database",
            ]
          + sid       = "GetGlueConnection"
        }
      + statement {
          + actions   = [
              + "rds:DescribeDBInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:rds:ca-central-1:687401027353:db:forms-staging-db-cluster-instance-2",
            ]
          + sid       = "DescribeFormsDBInstances"
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:687401027353:secret:rds-connector-mHsWnc",
            ]
          + sid       = "GetRDSConnectorSecret"
        }
    }

  # data.aws_iam_policy_document.glue_etl_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_etl_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "s3:GetObject"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::cds-forms-data-lake-bucket-staging/*",
                              + "arn:aws:s3:::cds-forms-data-etl-bucket-staging/*",
                            ]
                          + Sid      = "ReadDataLakeS3Buckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:PutObject",
                              + "s3:DeleteObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::cds-forms-data-lake-bucket-staging/*"
                          + Sid      = "WriteDataLakeS3TransformedBuckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "kms:RetireGrant",
                              + "kms:ReEncryptTo",
                              + "kms:ReEncryptFrom",
                              + "kms:GenerateDataKeyWithoutPlaintext",
                              + "kms:GenerateDataKey",
                              + "kms:Encrypt",
                              + "kms:DescribeKey",
                              + "kms:Decrypt",
                              + "kms:CreateGrant",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:kms:ca-central-1:687401027353:key/f2293de4-a13e-4948-9c7d-d158f976f239"
                          + Sid      = "UseGlueKey"
                        },
                      + {
                          + Action   = "logs:AssociateKmsKey"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/sessions*",
                              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/jobs*",
                              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/crawlers*",
                            ]
                          + Sid      = "AssociateKmsKey"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # aws_glue_connection.forms_database will be updated in-place
  ~ resource "aws_glue_connection" "forms_database" {
      ~ connection_properties = (sensitive value)
        id                    = "687401027353:forms-database"
        name                  = "forms-database"
        tags                  = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.glue_etl will be updated in-place
  ~ resource "aws_iam_policy" "glue_etl" {
        id               = "arn:aws:iam::687401027353:policy/service-role/AWSGlueETL-DataLake"
        name             = "AWSGlueETL-DataLake"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-forms-data-lake-bucket-staging/*",
                          - "arn:aws:s3:::cds-forms-data-etl-bucket-staging/*",
                        ]
                      - Sid      = "ReadDataLakeS3Buckets"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::cds-forms-data-lake-bucket-staging/*"
                      - Sid      = "WriteDataLakeS3TransformedBuckets"
                    },
                  - {
                      - Action   = [
                          - "glue:GetConnections",
                          - "glue:GetConnection",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:glue:ca-central-1:687401027353:connection/forms-database"
                      - Sid      = "GetGlueConnection"
                    },
                  - {
                      - Action   = "rds:DescribeDBInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:rds:ca-central-1:687401027353:db:forms-staging-db-cluster-instance-2"
                      - Sid      = "DescribeFormsDBInstances"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:rds-connector-mHsWnc"
                      - Sid      = "GetRDSConnectorSecret"
                    },
                  - {
                      - Action   = [
                          - "kms:RetireGrant",
                          - "kms:ReEncryptTo",
                          - "kms:ReEncryptFrom",
                          - "kms:GenerateDataKeyWithoutPlaintext",
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                          - "kms:CreateGrant",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:687401027353:key/f2293de4-a13e-4948-9c7d-d158f976f239"
                      - Sid      = "UseGlueKey"
                    },
                  - {
                      - Action   = "logs:AssociateKmsKey"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/sessions*",
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/jobs*",
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws-glue/crawlers*",
                        ]
                      - Sid      = "AssociateKmsKey"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_s3_object.historical_csv will be updated in-place
  ~ resource "aws_s3_object" "historical_csv" {
      ~ etag                          = "5fbd31872672f6c2691e963e42694198" -> "616a45498ad736cbe510d557c935a2e6"
        id                            = "historical_data.csv"
        tags                          = {}
      ~ tags_all                      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      ~ version_id                    = "rXxRM9uXdZC0XN8wDti8r_f0FawLCUCK" -> (known after apply)
        # (22 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.glue_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.rds_db_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_connection.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_historical_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_rds_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.historical_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.rds_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.rds_glue_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_csv"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_glue_script"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
